Repository: translate5/translate5
Catalog: application/modules/editor/testcases/editorAPI/Translate3117Test/resource1.tmx
Source language: de_de
Languages: en_uk, en_us

source: Er entwickelt sein Wissen und seine Erfahrung über Yoga in zahlreichen Weiterbildungen und Seminaren und ist Naam Yoga Lehrer Stufe 3, Kundalini Yoga Lehrer Stufe 1 und Harmonyum Practioner Stufe 2.
en_uk: He is developing his knowledge and experience with yoga in numerous training courses and seminars and is a Naam Yoga instructor level 3, a Kundalini Yoga instructor level 1, and a Harmonyum practitioner level 2.
en_us: He is developing his knowledge and experience with yoga in numerous training courses and seminars and is a Naam Yoga instructor level 3, a Kundalini Yoga instructor level 1, and a Harmonyum practitioner level 2.

source: translate5 Bildschirmfoto
en_uk: translate5 screenshot

source: Klick auf Datei springt zum ersten zugehörigen Segment
en_uk: By clicking on file, you get to the first related segment

source: Zudem unterrichtet er "Yoga for business" vor dem Hintergrund einer eigenen 16-jährigen täglichen Yoga- und Meditationspraxis.
en_uk: In addition, he is teaching "Yoga for business" against the backdrop of his own daily yoga and meditation practice of 16 years.

source: Integration in Ihr System
en_uk: Integration into Your System

source: Marc Mittag, Inhaber von MittagQI Quality Informatics, studierte vergleichende und systematische Religionswissenschaft, Philosophie und Pädagogik in Marburg und Tübingen und begann bereits während seines Studiums in der Webentwicklung zu arbeiten.
en_uk: Marc Mittag, owner of MittagQI Quality Informatics, studied comparative and systematic religion, philosophy, and education in Marburg and Tübingen and already started working in web development during his studies.
en_us: Marc Mittag, owner of MittagQI Quality Informatics, studied comparative and systematic religion, philosophy, and education in Marburg and Tübingen and already started working in web development during his studies.

source: Nach seinem Studium übernahm er bei der Sturz Gruppe die Verantwortung für die Webseiten und Online Magazine der Gruppe, die er durch gute Suchmaschinenoptimierung schnell weit nach vorne brachte.
en_uk: After graduation, he was in charge of the websites and online magazines of the "Sturz Gruppe", which he significantly brought to the fore in a very short time with the help of good search engine optimization.

source: In der Folge begann er, die Übersetzungsvor- und Nachbereitung bei transline Deutschland (Teil der Sturz Gruppe) mit diversen Entwicklungen zu optimieren und zu unterstützen.
en_uk: Subsequently, at transline Deutschland (a part of "Sturz Gruppe"), he began optimizing and supporting translation preparation and post-processing with the help of various developments.
en_us: Subsequently, at transline Deutschland (a part of “Sturz Gruppe”), he began optimizing and supporting translation preparation and post-processing with the help of various developments.

source: Von 2006 bis 2009 initierte und leitete er die Entwicklung von transAct, einer Software zur Automatisierung der Übersetzungsprozesse rund um Across und SDL Trados.
en_uk: From 2006 to 2009, he initiated and was in charge of the development of transAct, a software for the automation of the translation processes around Across and SDL Trados.
en_us: From 2006 to 2009, he initiated and was in charge of the development of transAct, a software for the automation of the translation processes around Across and SDL Trados.

source: 2009 gründete Marc Mittag sein Unternehmen "MittagQI Quality Informatics", welches seit dem mit innovativen Lösungen insbesondere für Übersetzungsdienstleister die Entwicklung der Übersetzungsbranche mit prägt.
en_uk: In 2009, Marc Mittag founded his company "MittagQI Quality Informatics", which, since then, has helped shape the development of the translation industry with innovative solutions, particularly for translation service providers.
en_us: In 2009, Marc Mittag founded his company "MittagQI Quality Informatics", which, since then, has helped shape the development of the translation industry with innovative solutions, particularly for translation service providers.

source: So entwickelt MittagQI Portale für Übersetzungsdienstleister und veröffentlichte 2012 mit "translate5 - the openTMS-WebClient" das erste Open Source Online-Review, welches im Bereich Usability, Benutzerführung und Terminologieintegration branchenweit Maßstäbe setzt.
en_uk: MittagQI is developing portals for translation service providers and, in 2012, published the first open source online review with "translate5 - the openTMS-WebClient", which is setting the standard throughout the industry in the area of usability, user guidance, and terminology integration.

source: Professionelle Softwareentwicklung mit Zend Framework, ExtJs, phpUnit und Selenium !
en_uk: Professional software development with Zend Framework, ExtJs, phpUnit, and Selenium !

source: Offenheit & Qualität ‒ unser Entwicklungs-Paradigma ‒ unsere Form der Kundenorientierung
en_uk: Openness & Quality - our Development Paradigm - our Form of Customer Orientation
en_us: Openness & Quality — our Development Paradigm — our Form of Customer Orientation

source: Unser Quellcode bleibt so auch langfristig bei Weiterentwicklungen gut wartbar und lesbar - auch für außenstehende Entwickler.
en_uk: This way, our source code can remain well maintained and read even in the long run - even for outside developers.
en_us: This way, our source code can remain well maintained and read even in the long run - even for outside developers.

source: Guter Quellcode sollte sich für einen guten Entwickler lesen, wie ein gutes Buch - das ist unser Anspruch.
en_uk: A good developer should be able to read good source code like a good book - that is our claim.
en_us: A good developer should be able to read good source code like a good book - that is our claim.

source: Da wir grundsätzlich offenen unverschlüsselten Quellcode ausliefern und mit den weit verbreiteten Programmiersprachen PHP und Javascript arbeiten, kann unsere Entwicklung jederzeit auch von Ihren internen Entwicklern oder externen Dritten fortgesetzt werden.
en_uk: Since we are always delivering open, unencrypted source code and working with the common programming languages PHP and JavaScript, our development can also be continued by your internal developers or external third parties at any time.
en_us: Since we are always delivering open, unencrypted source code and working with the common programming languages PHP and JavaScript, our development can also be continued by your internal developers or external third parties at any time.

source: Da wir aber mit am Markt weit verbreiteten hochentwickelten Softwarebibliotheken, Systemen und Programmiersprachen arbeiten, sind auch andere Entwicklungen jederzeit möglich !
en_uk: However, since we are working with highly developed software libraries, systems, and programming languages widespread on the market, other developments are also possible at any time !

source: Kompetenzen Softwareentwicklung
en_uk: Software development competencies
en_us: Software Development Competencies

source: Wir entwickeln auf Sie zugeschnittene Lösungen für Übersetzungsdienstleister und Industrieunternehmen!
en_uk: We are developing solutions tailored to you for translation service providers and industry businesses!
en_us: We are developing solutions tailored to you for translation service providers and industry businesses!

source: Dabei können wir auf langjährige Branchenerfahrung zurückgreifen!
en_uk: For that, we are able to draw on many years of experience in the industry!
en_us: For that, we are able to draw on many years of experience in the industry!

source: Langjährige Branchenerfahrung in der Entwicklung von Prozessautomatisierungen rund um Across und SDL Trados !
en_uk: Many years of experience in the industry in development of process automations regarding Across and SDL Trados !
en_us: Many years of experience in the industry in development of process automation regarding Across and SDL Trados !

source: Beispiele unserer Arbeit sind die Shops von satnam.eu (OsCommerce) und mantradownload.com (Magento).
en_uk: Samples of our work are the shops of satnam.eu (OsCommerce) and mantradownload.com (Magento).

source: Struktur, Design und Layout sind bei beiden Shops von dritter Seite entworfen.
en_uk: Structure, design, and layout are designed by third parties for both shops.

source: Mit translate5 entwickelt MittagQI einen Online-Client für Lektoren und Übersetzer, der Maßstäbe setzt - insbesondere hinsichtlich Oberfläche, Usability und flexibler bedürfnisorientierter Vorgehensweise beim Lektorat, aber auch bei einer Reihe weiterer Features.
en_uk: With the help of translate5, MittagQI develops an online client for editors and translators, which sets standards - in particular, in regard to surface, usability, and flexible, need-oriented procedure when editing, but also in a number of other features.

source: Alleinstellungsmerkmale translate5
en_uk: Unique selling points translate5

source: Beispiel Bildschirmfoto translate5 Hier finden Sie einen Überblick der Perpektiven, die translate5 Ihnen bietet!
en_uk: Beispiel Bildschirmfoto translate5 See here for an overview of perspectives offered to you by translate5!

source: Beispiel Bildschirmfoto translate5
en_uk: Example screenshot translate5

source: translate5 - Consulting zu Einsatz, Installation und Bedienung
en_uk: translate5 - consulting for application, installation, and operation
en_us: translate5 — consulting for application, installation, and operation

source: So setzten wir im Javascript-Bereich auf ExtJs, für PHP auf Zend Framework, für Unit-Testing auf phpUnit und für automatisiertes Oberflächentesting auf Selenium.
en_uk: Thus, we relied on ExtJs within the Javascript framework, for PHP on Zend Framework, for unit testing on phpUnit, and for automated surface testing on selenium.

source: Um Websites oder Webshops aufzusetzen arbeiten wir bevorzugt mit Joomla und Magento (welches wiederum auf Zend Framework basiert).
en_uk: For the set-up of websites or web shops, we prefer using Joomla and Magento (which again is based on Zend Framework).

source: Wir empfehlen, eine auf kontinuierliche Weiterentwicklung angelegte größere Software mit phpUnit- und / oder Seleniumtests zu hinterlegen.
en_uk: We recommend to deposit larger software created for ongoing further development with phpUnit and / or Selenium tests.

source: Initial ist dies mehr Aufwand, zahlt sich aber hinsichtlich Qualitätssicherung und der dafür benötigten Zeit spätestens dann aus, wenn im größeren Team oder durch Dritte weiterentwickelt wird.
en_uk: This is initially more effort, but, when it comes to quality assurance and the time needed for it, will pay off at the latest, when it is further developed in a larger team or by third parties.

source: Man sieht ggf. sehr schnell, "wo es kracht".
en_uk: If necessary, it can be very quickly determined "where it is crashing".

source: Bei künftigen Entwicklungsschritten kann auf Knopfdruck getestet werden, ob die bisherige Funktionalität noch gewährleistet ist
en_uk: In future development stages, you can test with the touch of a button, if the current functionality is still guaranteed.

source: Bei langfristig weiterentwickelter Software in großen Projekten ist neben der verbesserten Stabilität mit einer Kostenersparnis zu rechnen.
en_uk: With software further developed for long term in large projects, you can count on cost savings aside from improved stability.

source: Es wird zusammen mit allen bekannten Webprogrammiersprachen (wie PHP, Perl, Java, Ruby, etc.) eingesetzt.
en_uk: It is applied together with all known web programming languages (like PHP, Perl, Java, Ruby, etc.).

source: Ein Seleniumtest "klickt" sich durch die Anwendung, wie auch ein Benutzer es tun würde.
en_uk: A Selenium test "clicks" through the application, just as a user would do.

source: Oberflächen und Prozessautomatisierungen für die Übersetzungsbranche !
en_uk: surfaces and process automations for the translation industry !

source: Anwendungen im Browser mit Desktop-Feeling !
en_uk: applications in browser with desktop feeling !

source: zum optimalen Einsatz von SDL Trados Studio hinsichtlich verschiedenster Dateiformate, TM-Einsatz und Terminologieverwendung !
en_uk: on optimal application of SDL Trados Studio as to all different file formats, TM use, and use of terminology !

source: Wir optimieren Ihre Website für ein ideales Suchmaschinen-Ranking
en_uk: We Optimize Your Website for an Ideal Search Engine Ranking

source: Informieren Sie sich näher über unsere SEO-Kompetenzen !
en_uk: Find out more about our SEO competences !

source: Zur Anzeige muss JavaScript eingeschaltet sein!
en_uk: Javascript must be turned on for display!

source: Weitere Faktoren sind Betriebsgeheimnis von Google und Bing.
en_uk: Other factors are the trade secrets of Google and Bing.

source: Um sie zu erfassen ist gute Beobachtung, Gespür, langjährige Erfahrung und Intuition nötig.
en_uk: To comprehend them, good observation, feel, many years of experience, and intuition are required.

source: MittagQI betreibt Suchmaschinenoptimierung seit 2001 vor dem Hintergrund eines geisteswissenschaftlichen Studiums (sprachliche Kompetenz, Denken in komplexen Zusammenhängen), täglicher Meditationspraxis (Intuition) und längjähriger Erfahrung und Wissen in den relevanten Webtechnologien.
en_uk: Since 2001, MittagQI has been working with search engine optimization against the backdrop of liberal arts studies (language competence, thinking in complex contexts), daily meditation practice (intuition), and many years of experience and knowledge in relevant web technologies.

source: Bitte geben Sie den Sicherheitscode wie im Bild angezeigt ein
en_uk: Please enter the security code as shown in picture

source: Willkommen !
en_uk: Welcome !

source: Mit translate5 können Sie SDLXLIFF-Dateien im Browser lektorieren lassen - ohne Lizenzkosten - auf Open Source-Basis.
en_uk: With translate5, SDLXLIFF files can be edited in the browser - without license fees - on open source basis.

source: Testen Sie kostenlos auf www.translate5.net!
en_uk: Test Free of Charge at www.translate5.net!

source: Flexibelste Auszeichnung von QM-Fehlern auf Subsegment-Basis
en_uk: Most flexible labelling of QM errors on subsegment basis

source: Durchsuchbare Kommentare auf Segmentbasis
en_uk: Searchable comments on segment basis

source: Automatisierte Anpassung von Wiederholungen
en_uk: Automated adaptation of repetitions

source: Flexibel anpassbare Ansicht:
en_uk: Flexibly adjustable display:

source: Testen Sie kostenlos selbst:
en_uk: Test for Yourself Free of Charge:

source: Bildschirmfoto mit wichtigen Features
en_uk: Screenshot with Important Features

source: Nur die wichtigsten 4 Spalten und stark vergrößerte Schrift
en_uk: Only the most important 4 columns and greatly enlarged lettering

source: Umfangreiche und selbst befüllbarer QM-Kriterienbaum
en_uk: Extensive and a QM criteria tree that fills automatically

source: Ermöglicht flexibles Lektorat
en_uk: Enables flexible editing

source: Automatisch angepasste Wiederholung
en_uk: Automatically adjusted repetition

source: Segment-Metadaten
en_uk: Segment Meta Data

source: Ausgeklügelte Terminologieauszeichnung
en_uk: Sophisticated Labelling of Terminology

source: "Yoga for business" ist nicht Teil des Angebots von "MittagQI - Quality Informatics", sondern wird im Rahmen von "Naam Yoga Neckar Alb" angeboten.
en_uk: "Yoga for business" is not part of the range of products available at "MittagQI - Quality Informatics", but is offered at "Naam Yoga Neckar Alb".

source: translate5 als kostenlose Alternative für das Online-Lektorat von SDLXLIFF-Dateien interessiert Sie?
en_uk: Are you interested in translate5 as a free alternative for online editing of SDLXLIFF files?

source: Wir consulten Sie gern, wie Sie translate5 am besten nutzen!
en_uk: We will be happy to advise you in the best use of translate5!

source: Anpassung von translate5 an Ihre Bedürfnisse
en_uk: Customization of translate5 to Your Needs

source: Weiterentwicklung von translate5 - Entwicklung neuer Features
en_uk: Further Development of translate5 - Development of New Features

source: Kontaktieren Sie uns für ein persönliches Angebot!
en_uk: Contact us for a customized offer!

source: Integration von translate5 in Ihre Systemumgebung
en_uk: Integration of translate5 into Your System Environment

source: Beteiligen Sie sich an der Entwicklung!
en_uk: Participate in the Development!

source: Testen Sie translate5 sofort, kostenlos und ohne Registrierung auf translate5.net!
en_uk: Test translate5 immediately, free of charge, and without registration at translate5.net!

source: Hochflexible Filterung und Sortierung aller Segmente z. B. nach Metadaten wie Matchrate oder letzter Bearbeiter oder nach Segmentinhalt
en_uk: Highly flexible filtering and sorting of all segments e.g. according to meta data like Matchrate or last editor, or according to segment content

source: Dateiübersicht in Baumstruktur Klick auf Datei führt zum jeweiligen Dateianfang
en_uk: File overview in tree structure Clicking on file takes you to beginning of respective file

source: Ergonimic Mode Reduktion der Ansicht auf das Wesentliche
en_uk: Ergonomic Mode Reduction of the display to the essentials

source: Oberfläche in Deutsch und Englisch einfachst erweiterbar auf weitere Sprachen
en_uk: Surface in German and English easily expandable to additional languages

source: Nutzen einer Relaissprache Ihr Deutsch-Russisch-Lektor versteht kein Deutsch?
en_uk: Use of a relay language Your German-Russian editor does not understand any German?

source: Referenzdateien - Dateianhänge am Projekt
en_uk: Reference files - file attachments at the project

source: Hohe Performance bei großen Datenmengen
en_uk: High Performance with Large Amounts of Data

source: Ob 100 Segmente oder 10000 Segmente in einem Projekt - die Bearbeitungsgeschwindigkeit bleibt die Gleiche.
en_uk: Whether there are 100 segments or 10,000 segments - the speed of operation remains the same.

source: Im Browser sind immer nur die aktuellen 100 Segmente geladen.
en_uk: Only the current 100 segments are always downloaded to the browser.

source: Vorausladen im Hintergrund ermöglicht ein nahtloses Arbeiten.
en_uk: Advance loading in the background allows seamless work.

source: Beliebig viele Segmente fortlaufend scrollbar in einem Projekt
en_uk: Any Number of Segments can be Continuously Scrolled in a Project

source: Die einzelnen Dateien eines Projekts werden in einem Dateibaum analog dem Windows Explorer dargestellt.
en_uk: Each individual file of a project is displayed in a file tree analogous to Windows Explorer.

source: Hochflexible Filterung und Sortierung aller Segmente
en_uk: Highly Flexible Filtering and Sorting of all Segments

source: Dateiübersicht in Baumstruktur - Klick auf Datei führt zum jeweiligen Dateianfang
en_uk: File Overview in Tree Structure - Clicking on File takes you to Beginning of Respective File

source: Dateien in Baumstruktur umsortierbar
en_uk: Files in Tree Structure can be Resorted

source: Die initiale, ungefilterte und unsortierte Abfolge der Segmente in der Übersicht entspricht der Reihenfolge der Segmente in den Dateien und der Reihenfolge der Dateien im Dateibaum.
en_uk: The initial, unfiltered, and unsorted sequence of the segments in the overview corresponds with the order of the segments in the files and the order of the files in the file tree.

source: Entspricht diese Reihenfolge nicht den Bedürfnissen des Lektors, kann er durch einfaches Drag & Drop Dateien im Dateibaum umsortieren - die Reihenfolge der Segmente in der Übersicht ändert sich entsprechend.
en_uk: If this order does not comply with the editor's needs, he can resort files in the file tree by simply dragging & dropping - the order of the segments in the overview will change accordingly.

source: "Falsche Terminologie", "Schlechte Ausdrucksweise", "falsche Übersetzung" usw. Ein QM-Tag kennzeichnet also den entsprechenden Abschnitt in bestimmter qualitativer Hinsicht.
en_uk: "Wrong terminology", "bad Phrasing", "wrong translation" etc. So, a QM tag marks the respective paragraph to a certain, qualitative extent.

source: Jedem QM-Tag kann zusätzlich noch ein QM-Tag-spezifischer Kommentar und eine Gewichtung (schwerer, mittlerer oder leichter Fehler) zugewiesen werden.
en_uk: In addition, a QM tag-specific comment and an evaluation (of grave, mean, or light mistakes) can be assigned to each QM tag.

source: Eine QM-Statistik über die vergebenen QM-Tags erstellt translate5 jederzeit on-the-fly.
en_uk: translate5 creates on-the-fly QM statistics on assigned QM tags at any time.

source: So können auch Übersetzungsfehler sinnvoll erfasst werden, die ihren Ursprung bereits in Qualitätsproblemen der Ausgangssprache haben.
en_uk: This way, even translation errors, which already originated in quality problems of the source language, can be gathered in a useful way.

source: Neben der Auszeichnung von Subsegmenten mit QM-Tags können jedem Segment als ganzes ein oder mehrere QM-Kriterien zugeordnet werden.
en_uk: Aside from the labelling of subsegments with QM tags, one or several QM criteria can be assigned to each segment as a whole.

source: Welche QM-Kriterien und Statuswerte hier zur Verfügung stehen ist in translate5 einstellbar.
en_uk: Which QM criteria and status value are available here, can be set.

source: Die Auszeichnung von Terminologie im Segment ist State of the Art in modernen Übersetzungsumgebungen ‒ so auch in translate5:
en_uk: The labelling of terminology in the segment is state-of-the-art in modern translation environments - also in translate5:

source: Auf Basis dieser Datei werden Terme in den importierten bilingualen Dateien (z. B. SDLXLIFF) ausgezeichnet und in der Segmentübersicht entsprechend optisch hervorgehoben.
en_uk: Based on this file, terms in the imported, bi-lingual files (e.g. SDLXLIFF) are labelled and accordingly visually high-lighted in the segment overview.

source: Die Segment-Metadaten zeigen bei jedem Term an, ob es sich um eine Vorzugsbenennung, eine erlaubte Benennung oder eine verbotene Benennung handelt.
en_uk: The segment meta data indicate at each term, whether it is a preferred term, an allowed term, or a banned term.

source: Terminologie im Zielsegment wird auch ausgezeichnet, wenn der zugehörige quellsprachliche Term im Ausgangssegment nicht vorhanden ist.
en_uk: The terminology in the target segment is labelled, even if the corresponding source-language term does not exist in the source segment.

source: Zusätzlich wird die Schrift komfortabel vergrößert.
en_uk: In addition, the font is conveniently enlarged.

source: Flexibel anpassbare Ansicht - Ein- und Ausblenden von Spalten, Umgruppieren von Spalten etc.
en_uk: Flexibly Adjustable Display - Fading in and out of Columns, Restructuring of Columns, etc.

source: Auch der Dateibaum und die Segment-Metadaten können jederzeit ein- und ausgeblendet werden.
en_uk: The file tree and the segment meta data can also be faded in and out at any time.

source: So kann der Nutzer sich jederzeit sein translate5 selbst so einrichten, wie es für ihn die Bearbeitung am bequemsten macht.
en_uk: Thus, at any time, the user can customize translate5 so that editing is most convenient to him.

source: Im Ansichtsmodus Tags komplett ausblendbar
en_uk: In Display Mode, Tags can be Completely Faded Out

source: Daher sind hier die Tags komplett ausgeblendet.
en_uk: Therefore, the tags are completely faded out here.

source: Oberfläche in Deutsch und Englisch - einfachst erweiterbar auf weitere Sprachen
en_uk: Surface in German and English - Easily Expandable to Additional Languages
